ExchangePlans/vrgМобильныеСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<ExchangePlan>
		<Properties>
			<Name>vrgМобильныеСклад</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтбораСхемыОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретДоступа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольДляВходаНаУстройстве</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьРедактированиеДатыДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрашиватьКоличествоПриСканировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалАвтосохранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАвтосохранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДоступностиРедактированияДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьКартинки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейХраненияДокументовНаУстройстве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоПривязано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеТаблицыКомандРабочегоСтола</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаписиДокументовПриОбмене</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументИнвентаризация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументПоступление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументРеализация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументСписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументОприходование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументПеремещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументВозвратПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументВозвратОтКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументЗаказКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументЗаказПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУниверсальныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьРедактированиеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументТребованиеНакладная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>version</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМаршрутныйЛист</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

InformationRegisters/vrgНастройкиМобильныхУстройств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>vrgНастройкиМобильныхУстройств</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелУстройства</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.vrgМобильныеСклад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ExchangePlans/vrgМобильныеСклад/Forms/ФормаУзлаУправляемая/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Объект.Ссылка = ПланыОбмена.vrgМобильныеСклад.ЭтотУзел() Тогда
		Элементы.ОсновныеРеквизиты.Видимость = Ложь;
		Элементы.Страницы.Видимость = Ложь;
		Возврат;
	КонецЕсли;

	КонфигурацияСтароеЗначение = Объект.Конфигурация;

	ЗагрузитьНастройкиОтбора();

	ЗаписьНастроек = РегистрыСведений.vrgНастройкиМобильныхУстройств.СоздатьМенеджерЗаписи();
	ЗаписьНастроек.УзелУстройства = Объект.Ссылка;
	ЗаписьНастроек.Прочитать();
	Если ЗаписьНастроек.Выбран() Тогда
		ИдентификаторУстройства = ЗаписьНастроек.ИдентификаторУстройства;
	КонецЕсли;

	ОбъектУзла = РеквизитФормыВЗначение("Объект");
	ТаблицаЗначенийКоманд = ОбъектУзла.ХранилищеТаблицыКомандРабочегоСтола.Получить();
	Если ТипЗнч(ТаблицаЗначенийКоманд) = Тип("ТаблицаЗначений") Тогда
		ТаблицаКомандРабочегоСтола.Загрузить(ТаблицаЗначенийКоманд);
	Иначе
		СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Видимость = Истина;
	СтрокаТаблицы.Представление = "Строка пошуку";
	СтрокаТаблицы.Команда = "СтрокаПоиска";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Видимость = Истина;
	СтрокаТаблицы.Представление = "Обмін даними"; //+
	СтрокаТаблицы.Команда = "ОбменДанными";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Реалізація (створити)"; //+
	СтрокаТаблицы.Команда = "РеализацияСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Видимость = Истина;
	СтрокаТаблицы.Представление = "Реалізація (список)"; //+
	СтрокаТаблицы.Команда = "РеализацияСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Надходження (створити)"; //+
	СтрокаТаблицы.Команда = "ПоступлениеСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Видимость = Истина;
	СтрокаТаблицы.Представление = "Надходження (список)"; //+
	СтрокаТаблицы.Команда = "ПоступлениеСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Інвентаризація (створити)"; //+
	СтрокаТаблицы.Команда = "ИнвентаризацияСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Інвентаризація (список)"; //+
	СтрокаТаблицы.Команда = "ИнвентаризацияСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Оприбуткування (створити)"; //+
	СтрокаТаблицы.Команда = "ОприходованиеСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Оприбуткування (список)"; //+
	СтрокаТаблицы.Команда = "ОприходованиеСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Замовлення клієнта (створити)"; //+
	СтрокаТаблицы.Команда = "ЗаказКлиентаСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Замовлення клієнта (список)"; //+
	СтрокаТаблицы.Команда = "ЗаказКлиентаСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Замовлення постачальнику (створити)"; //+
	СтрокаТаблицы.Команда = "ЗаказПоставщикуСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Замовлення постачальнику (список)";//+
	СтрокаТаблицы.Команда = "ЗаказПоставщикуСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Переміщення (створити)"; //+
	СтрокаТаблицы.Команда = "ПеремещениеСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Переміщення (список)"; //+
	СтрокаТаблицы.Команда = "ПеремещениеСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();  //+
	СтрокаТаблицы.Представление = "Списання (створити)";
	СтрокаТаблицы.Команда = "СписаниеСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();  //+
	СтрокаТаблицы.Представление = "Списання (список)";
	СтрокаТаблицы.Команда = "СписаниеСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Повернення постачальнику (створити)";  //+
	СтрокаТаблицы.Команда = "ВозвратПоставщикуСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Повернення постачальнику (список)"; //+
	СтрокаТаблицы.Команда = "ВозвратПоставщикуСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Повернення клієнта (створити)"; //+
	СтрокаТаблицы.Команда = "ВозвратКлиентаСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Повернення клієнта (список)"; //+
	СтрокаТаблицы.Команда = "ВозвратКлиентаСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Універсальний документ (створити)"; //+
	СтрокаТаблицы.Команда = "УниверсальныйДокументСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Універсальний документ (список)";  //+
	СтрокаТаблицы.Команда = "УниверсальныйДокументСписок";
	
	//+NovashIV_24.01.2023
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Вимога накладна (создать)"; //+
	СтрокаТаблицы.Команда = "ТребованияСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Видимость = Истина;
	СтрокаТаблицы.Представление = "Вимога накладна (список)"; //+
	СтрокаТаблицы.Команда = "ТребованияСписок";
	//-NovashIV_24.01.2023

	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Видимость = Истина;
	СтрокаТаблицы.Представление = "Налаштування";
	СтрокаТаблицы.Команда = "Настройки";
		
	КонецЕсли;
	
	Элементы.СчетСписания.Видимость = (Объект.Конфигурация = "УТП");

	Если Параметры.Ключ.Пустая() Тогда
		Объект.РежимЗаписиДокументовПриОбмене = Элементы.РежимЗаписиДокументовПриОбмене.СписокВыбора[0].Значение;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НастройкиДляСохранения = КомпоновщикНастроек.ПолучитьНастройки();
	СтруктураНастроек = vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ПолучитьСтруктуруОтбораКомпоновкиДанных(НастройкиДляСохранения.Отбор);
	Хранилище = Новый ХранилищеЗначения(СтруктураНастроек);
	ТекущийОбъект.ХранилищеОтбораСхемыОбмена = Хранилище;
	ТекущийОбъект.ХранилищеТаблицыКомандРабочегоСтола = Новый ХранилищеЗначения(РеквизитФормыВЗначение("ТаблицаКомандРабочегоСтола"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВерсияМобильногоПриложенияПриИзменении(Элемент)
	
	ЗагрузитьНастройкиОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияМобильногоПриложенияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеКонтактнойИнформацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВосстановитьСтандартныеНастройки(Команда)
	
	ЗагрузитьСтандартныеНастройки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Выполняет заполнение настроек компоновщика на основе переданных параметров
//
// Параметры:
//  СхемаКомпоновки - схема компоновки данных, для которой компонуются настройки
//  НастройкиКомпоновки - настройки компоновки, загружаемые в компоновщик
//
Процедура ЗаполнитьНастройкиКомпоновщика(СхемаКомпоновки, НастройкиКомпоновки)
	
	Адрес = Новый УникальныйИдентификатор();
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновки, Адрес);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);
	
КонецПроцедуры	

&НаСервере
// Заполняет настройки компоновщика ранее сохраненными данными отбора
//
Процедура ЗагрузитьНастройкиОтбора()

	Если НЕ ЗначениеЗаполнено(Объект.Конфигурация) Тогда
		Возврат;
	КонецЕсли;

	СхемаКомпоновки = ПланыОбмена.vrgМобильныеСклад.ПолучитьМакет("СхемаКомпоновкиНастроекОбмена" + СокрЛП(Объект.Конфигурация));
	НастройкиКомпоновки = СхемаКомпоновки.НастройкиПоУмолчанию;
	ЗаполнитьНастройкиКомпоновщика(СхемаКомпоновки, НастройкиКомпоновки);
	
	ОбъектУзла = РеквизитФормыВЗначение("Объект");
	СтруктураОтбора = ОбъектУзла.ХранилищеОтбораСхемыОбмена.Получить();
	
	Если ТипЗнч(СтруктураОтбора) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураОтбора.Количество() > 0 Тогда	
		vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ЗаполнитьОтборКомпоновкиИзСтруктуры(КомпоновщикНастроек.Настройки.Отбор, СтруктураОтбора);
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Заполняет настройки компоновщика стандартными настройками, определенными при разработке
//
Процедура ЗагрузитьСтандартныеНастройки()

	Если НЕ ЗначениеЗаполнено(Объект.Конфигурация) Тогда
		Возврат;
	КонецЕсли;

	СхемаКомпоновки = ПланыОбмена.vrgМобильныеСклад.ПолучитьМакет("СхемаКомпоновкиНастроекОбмена" + СокрЛП(Объект.Конфигурация));
	НастройкиКомпоновки = СхемаКомпоновки.НастройкиПоУмолчанию;
	ЗаполнитьНастройкиКомпоновщика(СхемаКомпоновки, НастройкиКомпоновки);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	Если ПланыОбмена.vrgМобильныеСклад.ЭтотУзел() = ТекущийОбъект.Ссылка Тогда
		Возврат;
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.vrgНастройкиМобильныхУстройств.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УзелУстройства.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		ЗаписьНастроек = НаборЗаписей.Добавить();
		ЗаписьНастроек.УзелУстройства = Объект.Ссылка;
		ЗаписьНастроек.ИдентификаторУстройства = Строка(Новый УникальныйИдентификатор);
		НаборЗаписей.Записать();
	КонецЕсли;
	ПланыОбмена.ЗарегистрироватьИзменения(Объект.Ссылка, НаборЗаписей);

КонецПроцедуры

&НаКлиенте
Процедура КонфигурацияПриИзменении(Элемент)

	Если КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() Тогда
		ОписаниеОповещенияИзменениеКонфигурации = Новый ОписаниеОповещения("ВопросИзменениеКонфигурацииЗавершение", ЭтаФорма);
		ТекстВопроса = "При изменении конфигурации будут удалены установленные ранее настройки отбора данных. Уверены, что хотите продолжить?";
		ПоказатьВопрос(ОписаниеОповещенияИзменениеКонфигурации, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	ВопросИзменениеКонфигурацииЗавершение(КодВозвратаДиалога.Да);

КонецПроцедуры

&НаКлиенте
Процедура ВопросИзменениеКонфигурацииЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	НеобходимоМенятьЗначениеКонфигурации = (Результат = КодВозвратаДиалога.Да);
	Если НеобходимоМенятьЗначениеКонфигурации Тогда
		Попытка
			ЗагрузитьСтандартныеНастройки();
			КонфигурацияСтароеЗначение = Объект.Конфигурация;
		Исключение
			ТекстСообщения = "Не удалось загрузить стандартные настройки: %1";
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Сообщить(ТекстСообщения);
			НеобходимоМенятьЗначениеКонфигурации = Ложь;
		КонецПопытки;
	КонецЕсли;

	Если НЕ НеобходимоМенятьЗначениеКонфигурации Тогда
		Объект.Конфигурация = КонфигурацияСтароеЗначение;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	Если НЕ ПланыОбмена.vrgМобильныеСклад.ЭтотУзел() = Объект.Ссылка И НЕ ЗначениеЗаполнено(Объект.Конфигурация) Тогда
		Сообщить("Укажите имя конфигурации: это необходимо для корректной работы мобильного блока!");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьСписокКомандРабочегоСтола(Команда)
	
	ТаблицаКомандРабочегоСтола.Очистить();
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Видимость = Истина;
	СтрокаТаблицы.Представление = "Строка пошуку";
	СтрокаТаблицы.Команда = "СтрокаПоиска";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Видимость = Истина;
	СтрокаТаблицы.Представление = "Обмін даними"; //+
	СтрокаТаблицы.Команда = "ОбменДанными";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Реалізація (створити)"; //+
	СтрокаТаблицы.Команда = "РеализацияСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Видимость = Истина;
	СтрокаТаблицы.Представление = "Реалізація (список)"; //+
	СтрокаТаблицы.Команда = "РеализацияСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Надходження (створити)"; //+
	СтрокаТаблицы.Команда = "ПоступлениеСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Видимость = Истина;
	СтрокаТаблицы.Представление = "Надходження (список)"; //+
	СтрокаТаблицы.Команда = "ПоступлениеСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Інвентаризація (створити)"; //+
	СтрокаТаблицы.Команда = "ИнвентаризацияСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Інвентаризація (список)"; //+
	СтрокаТаблицы.Команда = "ИнвентаризацияСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Оприбуткування (створити)"; //+
	СтрокаТаблицы.Команда = "ОприходованиеСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Оприбуткування (список)"; //+
	СтрокаТаблицы.Команда = "ОприходованиеСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Замовлення клієнта (створити)"; //+
	СтрокаТаблицы.Команда = "ЗаказКлиентаСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Замовлення клієнта (список)"; //+
	СтрокаТаблицы.Команда = "ЗаказКлиентаСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Замовлення постачальнику (створити)"; //+
	СтрокаТаблицы.Команда = "ЗаказПоставщикуСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Замовлення постачальнику (список)";//+
	СтрокаТаблицы.Команда = "ЗаказПоставщикуСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Переміщення (створити)"; //+
	СтрокаТаблицы.Команда = "ПеремещениеСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Переміщення (список)"; //+
	СтрокаТаблицы.Команда = "ПеремещениеСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();  //+
	СтрокаТаблицы.Представление = "Списання (створити)";
	СтрокаТаблицы.Команда = "СписаниеСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();  //+
	СтрокаТаблицы.Представление = "Списання (список)";
	СтрокаТаблицы.Команда = "СписаниеСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Повернення постачальнику (створити)";  //+
	СтрокаТаблицы.Команда = "ВозвратПоставщикуСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Повернення постачальнику (список)"; //+
	СтрокаТаблицы.Команда = "ВозвратПоставщикуСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Повернення клієнта (створити)"; //+
	СтрокаТаблицы.Команда = "ВозвратКлиентаСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Повернення клієнта (список)"; //+
	СтрокаТаблицы.Команда = "ВозвратКлиентаСписок";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Універсальний документ (створити)"; //+
	СтрокаТаблицы.Команда = "УниверсальныйДокументСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Універсальний документ (список)";  //+
	СтрокаТаблицы.Команда = "УниверсальныйДокументСписок";
	
	//+NovashIV_24.01.2023
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Вимога накладна (создать)"; //+
	СтрокаТаблицы.Команда = "ТребованияСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Видимость = Истина;
	СтрокаТаблицы.Представление = "Вимога накладна (список)"; //+
	СтрокаТаблицы.Команда = "ТребованияСписок";
	//-NovashIV_24.01.2023
	
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Представление = "Маршрутный Лист (создать)"; //+
	СтрокаТаблицы.Команда = "МаршрутныйЛистСоздать";
	
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Видимость = Истина;
	СтрокаТаблицы.Представление = "Маршрутный Лист (список)"; //+
	СтрокаТаблицы.Команда = "МаршрутныйЛистСписок";
	//-NovashIV_24.01.2023


	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.Добавить();
	СтрокаТаблицы.Видимость = Истина;
	СтрокаТаблицы.Представление = "Налаштування";
	СтрокаТаблицы.Команда = "Настройки";

КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьСписокКомандРабочегоСтолаПредставление(Команда)
	
	ПараметрыОтбора = Новый Структура("Команда","СтрокаПоиска");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Строка пошуку";

	ПараметрыОтбора = Новый Структура("Команда","ОбменДанными");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Обмін даними";
	
	ПараметрыОтбора = Новый Структура("Команда","РеализацияСоздать");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Реалізація (створити)";

	ПараметрыОтбора = Новый Структура("Команда","РеализацияСписок");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Реалізація (список)";

	ПараметрыОтбора = Новый Структура("Команда","ПоступлениеСоздать");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Надходження (створити)";

	ПараметрыОтбора = Новый Структура("Команда","ПоступлениеСписок");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Надходження (список)";

	ПараметрыОтбора = Новый Структура("Команда","ИнвентаризацияСоздать");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Інвентаризація (створити)";

	ПараметрыОтбора = Новый Структура("Команда","ИнвентаризацияСписок");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Інвентаризація (список)";

	ПараметрыОтбора = Новый Структура("Команда","ОприходованиеСоздать");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Оприбуткування (створити)";

	ПараметрыОтбора = Новый Структура("Команда","ОприходованиеСписок");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Оприбуткування (список)";
	//2
	ПараметрыОтбора = Новый Структура("Команда","ЗаказКлиентаСоздать");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Замовлення клієнта (створити)";
	
	ПараметрыОтбора = Новый Структура("Команда","ЗаказКлиентаСписок");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Замовлення клієнта (список)";	
	
	ПараметрыОтбора = Новый Структура("Команда","ЗаказПоставщикуСоздать");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Замовлення постачальнику (створити)";
		
	ПараметрыОтбора = Новый Структура("Команда","ЗаказПоставщикуСписок");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Замовлення постачальнику (список)";
		
	ПараметрыОтбора = Новый Структура("Команда","ПеремещениеСоздать");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Переміщення (створити)";
	
	ПараметрыОтбора = Новый Структура("Команда","ПеремещениеСписок");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Переміщення (список)";
		
	ПараметрыОтбора = Новый Структура("Команда","СписаниеСоздать");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Списання (створити)";
	
	ПараметрыОтбора = Новый Структура("Команда","СписаниеСписок");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Списання (список)";
	
	ПараметрыОтбора = Новый Структура("Команда","ВозвратПоставщикуСоздать");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Повернення постачальнику (створити)";
	
	ПараметрыОтбора = Новый Структура("Команда","ВозвратПоставщикуСписок");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Повернення постачальнику (список)";
	
	ПараметрыОтбора = Новый Структура("Команда","ВозвратКлиентаСоздать");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Повернення клієнта (створити)";
	
	ПараметрыОтбора = Новый Структура("Команда","ВозвратКлиентаСписок");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Повернення клієнта (список)";
	
	ПараметрыОтбора = Новый Структура("Команда","УниверсальныйДокументСоздать");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Універсальний документ (створити)";
	
	ПараметрыОтбора = Новый Структура("Команда","УниверсальныйДокументСписок");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Універсальний документ (список)";
	
	Попытка                                           
		ПараметрыОтбора = Новый Структура("Команда","ТребованияСоздать");
		СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
		СтрокаТаблицы[0].Представление = "Вимога накладна (создать)";
		
		ПараметрыОтбора = Новый Структура("Команда","ТребованияСписок");
		СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
		СтрокаТаблицы[0].Представление = "Вимога накладна (список)";
	Исключение
		
	КонецПопытки;
	
	ПараметрыОтбора = Новый Структура("Команда","Настройки");
	СтрокаТаблицы = ТаблицаКомандРабочегоСтола.НайтиСтроки(ПараметрыОтбора);
	СтрокаТаблицы[0].Представление = "Налаштування";

КонецПроцедуры

#КонецОбласти
